#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
random_password.tunnel_secret[0]: Refreshing state... [id=none]
hcloud_primary_ip.devpush_ipv6: Refreshing state... [id=116254717]
hcloud_volume.hcloud_volume_storage: Refreshing state... [id=104576129]
hcloud_primary_ip.devpush_ipv4: Refreshing state... [id=116254718]
data.hcloud_ssh_key.main: Reading...
data.cloudflare_zone.main: Reading...
cloudflare_zero_trust_tunnel_cloudflared.devpush_tunnel[0]: Refreshing state... [id=22460582-5614-4b8d-a973-d0573dc0504b]
hcloud_firewall.devpush: Refreshing state... [id=10464909]
cloudflare_zero_trust_access_application.devpush_access_app[0]: Refreshing state... [id=eebe1334-6ba1-43f5-9aac-7a75ac33d340]
cloudflare_zero_trust_tunnel_cloudflared_config.devpush_config[0]: Refreshing state... [id=22460582-5614-4b8d-a973-d0573dc0504b]
data.cloudflare_zone.main: Read complete after 0s [id=90f6169e18a24a1b586965672cfbf6ba]
cloudflare_dns_record.wildcard[0]: Refreshing state... [id=8b80b8d5eefb837cb3bba6233a6cf1ee]
cloudflare_dns_record.devpush_tunnel_cname[0]: Refreshing state... [id=59f6272b086265bfc7c99a2f710ff933]
data.hcloud_ssh_key.main: Read complete after 1s [name=github[bot]@devpush-hetzner-infra]
cloudflare_dns_record.devpush_direct_v4: Refreshing state... [id=7e2d7b48c70adb66f43977f6e6a2c111]
cloudflare_dns_record.devpush_direct_v6: Refreshing state... [id=239754ea4595e928c35aa5ef9c718d63]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcloud_server.devpush will be created
  + resource "hcloud_server" "devpush" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = true
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 10464909,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-24.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + location                   = "nbg1"
      + name                       = "devpush"
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cax11"
      + shutdown_before_deletion   = false
      + ssh_keys                   = [
          + "106374654",
        ]
      + status                     = (known after apply)
      + user_data                  = (sensitive value)

      + public_net {
          + ipv4         = 116254718
          + ipv4_enabled = true
          + ipv6         = 116254717
          + ipv6_enabled = true
        }
    }

  # hcloud_volume_attachment.devpush_storage will be created
  + resource "hcloud_volume_attachment" "devpush_storage" {
      + automount = false
      + id        = (known after apply)
      + server_id = (known after apply)
      + volume_id = 104576129
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @collisdigital, Action: `pull_request`*